
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/tooruuetani/gh-terraform-workflow-test/actions/runs/9380694099)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.rpf_account.data.archive_file.test_terraform: Reading...
module.rpf_account.data.archive_file.test_terraform: Read complete after 0s [id=320b7c35b4de369b70b1af47bf92c6d288b6d987]
data.aws_caller_identity.current: Reading...
module.rpf_account.data.aws_caller_identity.current: Reading...
data.aws_region.now: Reading...
module.rpf_account.data.aws_region.now: Reading...
module.rpf_account.data.aws_region.now: Read complete after 0s [id=ap-northeast-1]
data.aws_region.now: Read complete after 0s [id=ap-northeast-1]
module.rpf_account.data.aws_caller_identity.current: Read complete after 0s [id=082954585471]
module.rpf_account.data.template_file.swagger: Reading...
module.rpf_account.data.template_file.swagger: Read complete after 0s [id=226882a37a50f9d46d8e8bbc485d09897aaad620740d1db0941171730842d017]
data.aws_caller_identity.current: Read complete after 0s [id=082954585471]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rpf_account.aws_api_gateway_deployment.main will be created
  + resource "aws_api_gateway_deployment" "main" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "4a1b8276a65c7d0cc125341184704348e8719144"
        }
    }

  # module.rpf_account.aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = <<-EOT
            openapi: 3.0.1
            info:
              title: TEST WebAPI
              version: 24.06.0 # 2024年06月1回目のリリース
            paths:
              "/":
                get:
                  description: Hello
                  responses:
                    "200":
                      description: Hello
                  x-amazon-apigateway-integration:
                    uri: arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:082954585471:function:rpf-301-prod:prod/invocations
                    responses:
                      default:
                        statusCode: "200"
                    passthroughBehavior: when_no_match
                    type: aws_proxy
                    httpMethod: POST
        EOT
      + created_date                 = (known after apply)
      + description                  = "WebAPI for RPF-301"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "RPF-301"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.rpf_account.aws_api_gateway_stage.main will be created
  + resource "aws_api_gateway_stage" "main" {
      + arn                   = (known after apply)
      + cache_cluster_enabled = false
      + cache_cluster_size    = "0.5"
      + deployment_id         = (known after apply)
      + execution_arn         = (known after apply)
      + id                    = (known after apply)
      + invoke_url            = (known after apply)
      + rest_api_id           = (known after apply)
      + stage_name            = "prod"
      + tags_all              = (known after apply)
      + web_acl_arn           = (known after apply)
    }

  # module.rpf_account.aws_cloudwatch_log_group.main will be created
  + resource "aws_cloudwatch_log_group" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/rpf-301-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.rpf_account.aws_iam_role.main will be created
  + resource "aws_iam_role" "main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonCognitoPowerUser",
          + "arn:aws:iam::aws:policy/AmazonDynamoDBFullAccess",
        ]
      + max_session_duration  = 3600
      + name                  = "rpf-301-lambda-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "rpf-301-lambda-role-inline-prod"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogStream",
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:logs:ap-northeast-1:082954585471:log-group:/aws/lambda/rpf-301-*:*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:logs:ap-northeast-1:082954585471:log-group:/aws/lambda/rpf-301-*:*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "secretsmanager:GetSecretValue",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.rpf_account.aws_lambda_alias.main will be created
  + resource "aws_lambda_alias" "main" {
      + arn              = (known after apply)
      + function_name    = "rpf-301-prod"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "prod"
    }

  # module.rpf_account.aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../../../account/lambda.zip"
      + function_name                  = "rpf-301-prod"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "mKDl3R/OSV3N8lqxcg8qPr9fCq4lSd8h4U4fiigFkfQ="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
module.rpf_account.aws_cloudwatch_log_group.main: Creating...
module.rpf_account.aws_api_gateway_rest_api.main: Creating...
module.rpf_account.aws_iam_role.main: Creating...
module.rpf_account.aws_cloudwatch_log_group.main: Creation complete after 1s [id=/aws/lambda/rpf-301-prod]
module.rpf_account.aws_iam_role.main: Creation complete after 1s [id=rpf-301-lambda-role-prod]
module.rpf_account.aws_lambda_function.main: Creating...
module.rpf_account.aws_api_gateway_rest_api.main: Creation complete after 2s [id=480m3wtpo3]
module.rpf_account.aws_api_gateway_deployment.main: Creating...
module.rpf_account.aws_api_gateway_deployment.main: Creation complete after 0s [id=khb8lu]
module.rpf_account.aws_api_gateway_stage.main: Creating...
module.rpf_account.aws_api_gateway_stage.main: Creation complete after 1s [id=ags-480m3wtpo3-prod]
module.rpf_account.aws_lambda_function.main: Still creating... [10s elapsed]
module.rpf_account.aws_lambda_function.main: Creation complete after 15s [id=rpf-301-prod]
module.rpf_account.aws_lambda_alias.main: Creating...
module.rpf_account.aws_lambda_alias.main: Creation complete after 0s [id=arn:aws:lambda:ap-northeast-1:082954585471:function:rpf-301-prod:prod]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"account_terraform_apply_prod","PRNumber":5,"Program":"tfcmt","SHA1":"ace55cde1593e31a6e9d2173efec43a9d30622ef","Vars":{},"WorkflowName":"release-account-deploy"} -->